app/controllers/matches_controller.rb

  def index
    @matches = Match.upcoming.includes(:created_by, :participants).order(:date, :time)
---
SELECT "matches".* FROM "matches" WHERE (date >= '2025-09-25') ORDER BY "matches"."date" ASC, "matches"."time" ASC

  def show
    @participation = current_user.participations.find_by(match: @match)
---
SELECT "participations".* FROM "participations" WHERE "participations"."user_id" = 6 AND "participations"."match_id" = 2 LIMIT 1

  def create
    @match = current_user.created_matches.build(match_params)
    if @match.save
---
INSERT INTO "matches" ("title", "description", "date", "time", "location", "created_by_id", "created_at", "updated_at") VALUES ('BS vs BL', '', '2025-10-03', '2000-01-01 23:49:00', 'BS', 7, '2025-09-25 09:38:31.688430', '2025-09-25 09:38:31.688430') RETURNING "id"

  def destroy
    if @match.created_by == current_user
      @match.destroy
---
DELETE FROM "matches" WHERE "matches"."id" = 4

  def set_match
    @match = Match.find(params[:id])
---
SELECT "matches".* FROM "matches" WHERE "matches"."id" = 2 LIMIT 1