app/controllers/participations_controller.rb

INSERT INTO "participations" ("user_id", "match_id", "status", "created_at", "updated_at") VALUES (6, 2, 'confirmed', '2025-09-25 08:41:49.962188', '2025-09-25 08:41:49.962188') RETURNING "id"
---
  def create
    @participation = @match.participations.build(user: current_user, status: params[:status])

    if @participation.save

SELECT "participations".* FROM "participations" WHERE "participations"."match_id" = 2 AND "participations"."user_id" = 7 LIMIT 1
UPDATE "participations" SET "status" = 'declined', "updated_at" = '2025-09-25 09:28:28.028468' WHERE "participations"."id" = 10
---
  def update
    @participation = @match.participations.find_by(user: current_user)

    if @participation && @participation.update(status: params[:status])

SELECT "participations".* FROM "participations" WHERE "participations"."match_id" = 3 AND "participations"."user_id" = 7 LIMIT 1
DELETE FROM "participations" WHERE "participations"."id" = 8
---
  def destroy
    @participation = @match.participations.find_by(user: current_user)

    if @participation&.destroy

SELECT "matches".* FROM "matches" WHERE "matches"."id" = 2 LIMIT 1
---
  def set_match
    @match = Match.find(params[:match_id])