app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "role", "created_at", "updated_at") VALUES ('eme', 'test@gmail.com', '$2a$12$hiPAwd0yM3qEhY8txaHutOUDdfo1IPfMljGM9l.Dl5vUNZlF/m6e6', 'player', '2025-09-25 08:41:36.214150', '2025-09-25 08:41:36.214150') RETURNING "id"
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save